{
  "book_name": "Genesis",
  "nouns": [
    {
      "name": "Adam",
      "hebrew": "אדם",
      "hebrew_with_nikud": "אָדָם",
      "value": 45,
      "calculation": "א(1) + ד(4) + ם(40) = 45",
      "primary_verse": "Genesis 2:7",
      "verse_refs": ["Genesis 1:26", "Genesis 2:7", "Genesis 2:19", "Genesis 2:23", "Genesis 3:17", "Genesis 3:21"],
      "meaning": "man, human, mankind",
      "semantic_tags": ["person", "creation", "humanity"],
      "insights": "Adam represents the pinnacle of God's creation, formed from the dust of the earth and given the breath of life. As the federal head of humanity, Adam's choices in the Garden of Eden established the pattern of human rebellion against divine authority, necessitating the redemptive work of the promised Messiah. The name 'Adam' itself reflects the earth's composition, symbolizing humanity's connection to the material world while bearing the divine image.",
      "theological_significance": "Adam serves as a type of Christ in Romans 5, where his disobedience brought condemnation to all, just as Christ's obedience brings justification. This federal headship underscores the covenantal nature of God's relationship with humanity.",
      "strong_number": "H0120"
    },
    {
      "name": "Hevel",
      "hebrew": "הבל",
      "hebrew_with_nikud": "הֶבֶל",
      "value": 37,
      "calculation": "ה(5) + ב(2) + ל(30) = 37",
      "primary_verse": "Genesis 4:2",
      "verse_refs": ["Genesis 4:2", "Genesis 4:3", "Genesis 4:4", "Genesis 4:8", "Genesis 4:9", "Genesis 4:25"],
      "meaning": "breath, vapor, vanity",
      "semantic_tags": ["person", "offering", "brevity"],
      "insights": "The name Abel, meaning 'breath' or 'vapor', prophetically points to the fleeting nature of human life and the transience of worldly accomplishments. Abel's righteous offering of the firstborn of his flock foreshadowed Christ's sacrifice as the unblemished Lamb of God. His murder by Cain illustrates the conflict between the seed of the woman and the seed of the serpent, establishing the biblical theme of martyrdom for faithfulness to God.",
      "theological_significance": "Abel represents the faithful remnant who offer acceptable worship to God through faith. Hebrews 11:4 commends his faith, showing that true worship requires both proper form and sincere faith. His blood crying from the ground symbolizes God's remembrance of righteous suffering.",
      "strong_number": "H0189"
    }
  ]
}
